
## Plan Result

[CI link](https://github.com/Digix00/hackathon/actions/runs/23262209199)


<pre><code>Plan: 2 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * google_cloud_scheduler_job.worker_kick
  * google_service_account_iam_member.terraform_ci_actas_scheduler
* Update
  * google_cloud_run_v2_service.api


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_cloud_run_v2_service.api will be updated in-place
  ~ resource "google_cloud_run_v2_service" "api" {
        id                      = "projects/musicswapping/locations/asia-northeast1/services/api"
        name                    = "api"
        # (33 unchanged attributes hidden)

      - scaling {
          - manual_instance_count = 0 -> null
          - min_instance_count    = 0 -> null
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # google_cloud_scheduler_job.worker_kick will be created
  + resource "google_cloud_scheduler_job" "worker_kick" {
      + id        = (known after apply)
      + name      = "worker-kick"
      + paused    = (known after apply)
      + project   = "musicswapping"
      + region    = "asia-northeast1"
      + schedule  = "*/10 * * * *"
      + state     = (known after apply)
      + time_zone = "Asia/Tokyo"

      + http_target {
          + http_method = "POST"
          + uri         = "https://run.googleapis.com/v2/projects/musicswapping/locations/asia-northeast1/jobs/worker:run"

          + oauth_token {
              + service_account_email = "scheduler-sa@musicswapping.iam.gserviceaccount.com"
            }
        }
    }

  # google_service_account_iam_member.terraform_ci_actas_scheduler will be created
  + resource "google_service_account_iam_member" "terraform_ci_actas_scheduler" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:terraform-ci-sa@musicswapping.iam.gserviceaccount.com"
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = "projects/musicswapping/serviceAccounts/scheduler-sa@musicswapping.iam.gserviceaccount.com"
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":112,"Program":"tfcmt","SHA1":"a1807c4c76857d56b01be92b35476b5fd0abe30b","Vars":{},"WorkflowName":"terraform-plan"} -->